Repository: 84000/translation-memory-resources
Catalog: post_input/toh70.bo.en.tmx
Source language: bo
Languages: en

source: བསམ་གཏན་ བྱེད་པ་ དང་ །_ བསམ་གཏན་ བྱས་པ་ དང་ །_ |#| ལངས་ ནས་ ཀྱང་
en: While doing these practices, and again after doing them,

source: གལ་ཏེ་ བསམ་གཏན་ དེ་ དང་ །_ ཏིང་ངེ་འཛིན་ དེ་ ལ་ སློབ་པ འི་ ནུས་པ་ དང་ མི་ ལྡན་པ ར་ གྱུར་ ན་ དེ་ འདི་ལྟར་ ཡང་དག་ པར་ སློབ་ སྟེ །_
en: $78 “Should they lack the capacity to train in those concentrations and absorptions then this is how they properly train:

source: དུས་ དུས་ སུ་ འམ །_ ཅུང་ཟད་ ཅུང་ཟད་ དུ་ ཡང་ སེམས་ རྣམ་པར་ གཡེང་བ་ དང་ །_ ཏིང་ངེ་འཛིན་ མ་ ཡིན་ [170b] པ་ སྤང་བ་ དང་ །_ དོར་བ་ དང་ །_ བསལ་བ ར་ རྩོལ་ ལོ །_། འབད་ དོ །_།
en: From time to time, or little by little, they strive and exert themselves in abandoning, forsaking, and eliminating distraction and non-absorption. [170.b]

source: དུས་ དུས་ སུ་ འམ །_ ཅུང་ཟད་ ཅུང་ཟད་ དུ་ ཡང་ སེམས་ རྩེ་གཅིག་ ཏུ་ བྱ་བ་ དང་ །_ སེམས་ མཉམ་པ ར་ གཞག་ པར་ སློབ་པ་ དང་ །_ མངོན་པར་ འཕེལ་བ ར་ བྱ་བ་ དང་ །_ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ ར་ རྩོལ་ ལོ །_། འབད་ དོ །_།
en: From time to time, or little by little, they also strive and exert themselves in training, developing, and perfecting the practice of single-pointedly focusing their minds and resting them in equipoise.

source: སྲིད་པ་ གཞན་ དུ་ གྱུར་པ་ ན་ ཞུམ་པ ར་ མི་ འགྱུར་ ཞིང་ སྒྱིད་ལུག་ པར་ མི་ འགྱུར་ རོ །_།
en: Even when they take another rebirth, they do not become disheartened or discouraged.

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ སེམས་ རྗེས་སུ་ དྲན་པ་ དང་ །_ |#| བྱང་ཆུབ་ ཀྱི་ སེམས་ སྒོམ་པ་ དང་ །_
en: Subāhu, bodhisattvas’ formation of the resolve set on awakening, their recollection and cultivation of the resolve set on awakening,

source: བྱང་ཆུབ་ ཏུ་ སྨོན་པ་ དང་ །_ བྱང་ཆུབ་ ཏུ་ སྨོན་ལམ་ འདེབས་པ་ གང་ཡིན་པ་ དེ་ཉིད་ དེ་དག་ གི་ སེམས་ མཉམ་པ ར་ གཞག་པ་ དགེ་བ་ དང་ །_ སེམས་ རྩེ་གཅིག་ ཏུ་ བྱ་བ་ དགེ་བ་ གྲངས་མེད་ ཅིང་ དཔག་ ཏུ་ མེད་པ་ ཡིན་ ནོ །_།
en: and their aspirations and prayers for awakening are themselves the bodhisattvas’ incalculable and immeasurable virtues of resting their minds in equipoise and focusing their minds single-pointedly.

source: འདི་ལྟར་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ ཟག་པ་ མེད་པ འི་ སེམས་ མཉམ་པ ར་ གཞག་པ་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ མི་སློབ་པ འི་ སེམས་ མཉམ་པ ར་ གཞག་པ་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ ཟག་པ་ མེད་པ འི་ སེམས་ མཉམ་པ ར་ གཞག་པ་ ཡང་དག་ པར་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ མི་སློབ་པ འི་ སེམས་ མཉམ་པ ར་ གཞག་པ་ ཡང་དག་ པར་ བསྐྱེད་པ ར་ འདོད་པ་ དེ་ ནི །_ |#| སེམས་ མཉམ་པ ར་ གཞག་པ་ དགེ་བ་ དང་ །_ སེམས་ རྩེ་གཅིག་ ཏུ་ བྱ་བ་ དགེ་བ་ མཐའ་ ཡ ས་ མུ་མེད་པ་ ཡིན་ ནོ །_།
en: It is because the wish to engender undefiled concentration and concentration at the level of no-more-training, and to do so perfectly, in all beings throughout all world systems, |#| is the infinite and boundless virtue of resting one’s mind in equipoise and focusing one’s minds single-pointedly.

source: ལག་ བཟངས་ དེ་ལྟ ར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ བདེ་བ་ དང་ ལྡན་ ལ་ ཡིད་ བདེ་བ་ དང་ ལྡན་ ཞིང་ ཚེགས་ ཆུང་ངུ་ དང་ །_ སྡུག་བསྔལ་ ཆུང་ངུ ས་ བསམ་གཏན་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ དོ །_།
en: $80 “Subāhu, in this way bodhisattvas complete the perfection of concentration, with ease and pleasure, little difficulty, and little pain.”

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཇི་ལྟ ར་ ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ ཅེ་ན །_
en: $81 “Subāhu, how do bodhisattvas complete the perfection of insight?

source: ལག་ བཟངས་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ མདུང་ཐུང་ དག་ གིས་ བཟློག་ ཀྱང་ གང་ཟག་ གང་དག་ ཐོས་པ་ མང་བ །_ ཐོས་པ་ འཛིན་པ །_ |#| ཐོས་པ་ བསགས་པ །_ དོན་ ཤེས་པ །_ བཤད་པ་ ཤེས་པ །_ དཔྱོད་པ་ ཅན །_ |#| ཇི་ལྟ ར་ ཐོས་པ འི་ དོན་ ཡོངས་སུ་ རྟོགས་པ་ དེ་དག་ ལ་ སྙེན་ ཅིང་ སྟེན་ ཏེ་ བསྙེན་བཀུར་ བྱེད་ དོ །_།
en: Subāhu, even if they are turned back with spears, they approach, rely upon, and venerate individuals who are learned, |#| retain what they have learned, and have collected what they have learned, as well as those who understand the content, |#| are well-spoken, are discerning, and who have reflected upon#34 the significance of what they have learned.

source: དེ་ ཐོས་པ འི་ ཆེད་ དང་ །_ བཤད་པ འི་ ཆེད་ དང་ །_ དོན་ གྱི་ ཆེད་ དང་ །_ དོན་ ལ་ ཡོངས་སུ་ བརྟག་པ འི་ ཆེད་ དང་ །_ སློབ་དཔོན་ དང་ མཁན་པོ་ ལ་ བསྙེན་བཀུར་ བྱ་བ འི་ ཆེད་ [171a] ལ་ |#| གྲང་བ་ ཡང་ ཁྱད་ དུ་ གསོད །_
en: For the sake of learning, explanations, content, reflecting upon the significance, and venerating masters and preceptors, [171.a] |#| they disregard cold,

source: ཚ་བ་ དང་ །_ བཀྲེས་པ་ དང་ །_ སྐོམ་པ་ དང་ །_ ཤ་སྦྲང་ དང་ །_ སྦྲང་བུ་ དང་ །_ རླུང་ དང་ །_ ཉི་མ་ དང་ །_ སྡིག་སྦྲུལ་ གྱིས་ རེག་པ་ དང་ །_ གཞན་ གྱིས་ ངན་ དུ་ སྨྲས་ ཤིང་ ངན་ དུ་ བརྗོད་པ འི་ ཚིག་ གི་ ལམ་ དང་ །_ ལུས་ ཀྱི་ ཚོར་བ་ དྲག་པ །_ རྩུབ་པ །_ མི་བཟད་པ །_ སྲོག་ འཆད་པ ར་ འགྱུར་བ་ ཡང་ ཁྱད་ དུ་ གསོད་ དོ །_།
en: [they disregard] heat, hunger, thirst, gadflies, horseflies, wind, sun, encounters with scorpions and snakes, others’ offensive words and insulting name-calling, violent, rough, or unbearable physical sensations, and even being killed.

source: དེ་ ཆོས་ རྣམས་ ལ་ ནི་ རིན་པོ་ཆེར་ འདུ་ཤེས་ ཉེ་བ ར་ གནས །_
en: They maintain the perception that Dharma teachings are precious jewels.

source: ཆོས་ སྨྲ་བ་ རྣམས་ ལ་ རིན་པོ་ཆེ འི་ གཏེར་ དུ་ འདུ་ཤེས །_
en: They observe the perception that Dharma preachers are treasuries of precious jewels.

source: ཆོས་ ཉན་པ་ ལ་ ནི་ དཀོན་པ་ རྙེད་པ ར་ འདུ་ཤེས །_
en: They observe the perception that listening to the Dharma is discovering something rare.

source: ཆོས་ འཛིན་པ་ ལ་ ནི་ དོན་ཡོད་ པར་ སྲོག་ སོགས་ པར་ འདུ་ཤེས །_
en: They observe the perception that retaining the Dharma is as important as life.

source: ཆོས་ ཀྱི་ ཡོན་ཏན་ མང་ དུ་ བྱེད་པ་ ལ་ ནི་ སྲོག་ དོན་ཡོད་ པར་ འདུ་ཤེས །_
en: They observe the perception that amassing the qualities of Dharma is vitally important.

source: ཆོས་ ལ་ ཡོངས་སུ་ རྟོག་པ་ ལ་ ནི་ ཚེ་རབས་ བརྒྱ ར་ མི་ རྙེད་པ ར་ འདུ་ཤེས་ ཉེ་བ ར་ གནས་པ་ ཡིན་ ཏེ
en: They observe the perception that reflecting on the Dharma is an opportunity that will not be found again within a hundred lifetimes.

source: དེར་ ཆོས་ དེ་དག་ ཉན་ ཅིང་ འཛིན་ ལ་ མང་ དུ་ བྱེད་ ཅིང་ ཡོངས་སུ་ རྟོག་ ན་ ཁམས་ རྣམས་ ཀྱང་ རབ་ཏུ་ ཤེས །_
en: $82 “When bodhisattvas hear those Dharma teachings, and, retaining them, study and reflect upon them, they will come to know the constituents.

source: ཕུང་པོ་ རྣམས་ དང་ །_ སྐྱེ་མཆེད་ རྣམས་ དང་ །_ འཕགས་པ འི་ བདེན་པ་ རྣམས་ དང་ །_ རྟེན་ ཅིང་ འབྲེལ་ པར་ འབྱུང་བ་ དང་ །_ དུས་ དང་ །_ ཐེག་པ་ རྣམས་ དང་ །_ དགེ་བ་ བསགས་པ་ ཡང་ རབ་ཏུ་ ཤེས་ སོ །_།
en: They will also come to know the aggregates, the sense spheres, the truths of noble beings, dependent origination, time, the vehicles, and the accumulation of virtue.

source: ཁམས་ རྣམས་ ཇི་ལྟ ར་ རབ་ཏུ་ ཤེས་ ཤེ་ན །_
en: $83 “How do bodhisattvas understand the constituents?

source: ཁམས་ ནི་ གཉིས་ ཏེ །_ འདུས་བྱས་ དང་ །_ འདུས་མ་བྱས་ ཤེས་བྱ་བ་ སྟེ །_
en: The constituents are twofold, known as conditioned and unconditioned.

source: ཁམས་ གཉིས་པོ་ དེ་དག་ གོ _།
en: These are the two constituents.

source: འདུས་བྱས་ ཀྱི་ ཁམས་ ནི་ གང་ །_ འདུས་མ་བྱས་ ཀྱི་ ཁམས་ ནི་ གང་ཞེ་ན །_
en: What are conditioned and unconditioned constituents?

source: གང་ཅི་ ཡང་ རུང་ སྟེ །_ |#| སྐྱེ་བ་ དང་ །_ གནས་པ་ དང་ །_ འགག་པ་ འདི་ ནི་ འདུས་བྱས་ ཀྱི་ ཁམས་ ཞེས་ བྱ འོ །_།
en: A conditioned constituent is anything whatsoever that arises, remains, and ceases.

source: གང་ཅི་ ཡང་ རུང་ སྟེ །_ |#| སྐྱེ་བ་ མེད་པ་ དང་ །_ གནས་པ་ མེད་པ་ དང་ །_ འགག་པ་ མེད་པ་ དེ་ ནི་ འདུས་མ་བྱས་ ཀྱི་ ཁམས་ ཞེས་ བྱ་ སྟེ །_
en: An unconditioned constituent is anything whatsoever that does not arise, remain, or cease.

source: དེ་ལྟ ར་ འདུས་བྱས་ དང་ །_ འདུས་མ་བྱས་ ཀྱི་ ཁམས་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Thus do they understand the conditioned and unconditioned constituents.

source: གཞན་ ཡང་ ཁམས་ གསུམ་ རབ་ཏུ་ ཤེས་ ཏེ །_ དགེ་བ འི་ ཁམས་ དང་ །_ མི་དགེ་བ འི་ ཁམས་ དང་ །_ ལུང་ དུ་མ་ བསྟན་པ འི་ ཁམས་ ཏེ་ གསུམ་པོ་ དེ་དག་ གོ _།
en: $84 “Moreover, bodhisattvas know the three constituents: virtuous, non-virtuous, and neutral constituents.

source: དགེ་བ འི་ ཁམས་ ནི་ གང་ །_ མི་དགེ་བ འི་ ཁམས་ ནི་ གང་ །_ ལུང་ དུ་མ་ བསྟན་པ འི་ ཁམས་ ནི་ གང་ཞེ་ན །_
en: What are virtuous, non-virtuous, and neutral constituents?

source: གང་ཅི་ ཡང་ རུང་ སྟེ །_ |#| ཆགས་པ་ མེད་པ་ དང་ །_ ཆགས་པ་ མེད་པ་ དང་ ལྡན་པ་ དང་ །_ |#| གང་ཅི་ ཡང་ རུང་ སྟེ །_ |#| ཞེ་སྡང་ མེད་པ་ དང་ །_ ཞེ་སྡང་ མེད་པ་ དང་ ལྡན་པ་ དང་ །_ |#| གང་ཅི་ ཡང་ རུང་ སྟེ །_ |#| [171b] གཏི་མུག་ མེད་པ་ དང་ །_ གཏི་མུག་ མེད་པ་ དང་ ལྡན་པ་ དེ་ ནི་ དགེ་བ འི་ ཁམས་ ཞེས་ བྱ འོ །_།
en: A virtuous constituent is anything whatsoever that lacks attachment or is associated with a lack of attachment, |#| anything whatsoever that lacks anger or is associated with a lack of anger, and |#| anything whatsoever that lacks ignorance [171.b] or is associated with a lack of ignorance.

source: གང་ཅི་ ཡང་ རུང་ སྟེ །_ |#| ཆགས་པ་ དང་ །_ ཆགས་པ་ དང་ ལྡན་པ་ དང་ །_ གང་ཅི་ ཡང་ རུང་ སྟེ །_ ཞེ་སྡང་ དང་ །_ ཞེ་སྡང་ དང་ ལྡན་པ་ དང་ །_ གང་ཅི་ ཡང་ རུང་ སྟེ །_ གཏི་མུག་ དང་ །_ གཏི་མུག་ དང་ ལྡན་པ་ དེ་ ནི་ མི་དགེ་བ འི་ ཁམས་ ཞེས་ བྱ འོ །_།
en: A non-virtuous constituent is anything whatsoever that has attachment or is associated with attachment, anything whatsoever that has anger or is associated with anger, and anything whatsoever that has ignorance or is associated with ignorance.

source: དེ་ གཉིས་ ལ་མ་ གཏོགས་པ་ ནི་ ལུང་ དུ་མ་ བསྟན་པ་ ཉིད་ དེ །_ དེ་ལྟ ར་ ཁམས་ གསུམ་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Neutrality is anything not included within those two. Thus do bodhisattvas understand the three constituents.

source: གཞན་ ཡང་ ཁམས་ གསུམ་ རབ་ཏུ་ ཤེས་ ཏེ །_
en: $85 “Moreover, bodhisattvas know the three realms.

source: གསུམ་ གང་ཞེ་ན །_
en: What are the three?

source: འདོད་པ འི་ ཁམས་ དང་ །_ གཟུགས་ ཀྱི་ ཁམས་ དང་ །_ གཟུགས་ མེད་པ འི་ ཁམས་ སོ །_།
en: The desire realm, the form realm, and the formless realm.

source: འདོད་པ འི་ ཁམས་ གང་ཞེ་ན །_
en: What is the desire realm?

source: སེམས་ཅན་ དམྱལ་བ་ དང་ །_ དུད་འགྲོ འི་ སྐྱེ་གནས་ དང་ །_ ཡི་དགས་ དང་ །_ ལྷ་མ་ ཡིན་ དང་ །_ མི་ དང་ །_ |#| རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ དང་ །_ སུམ་ཅུ་རྩ་གསུམ་ དང་ །_ འཐབ་བྲལ་ དང་ །_ དགའ་ལྡན་ དང་ །_ འཕྲུལ་དགའ་ དང་ གཞན་འཕྲུལ་ དབང་ བྱེད་ ཀྱི་ ལྷ་ རྣམས་ ཏེ །_ |#| གང་དེ་ དག་ ལ་ འདུན་པ་ དང་ །_ ཆགས་པ་ དང་ །_ ཞེ་སྡང་བ་ དང་ །_ གཏི་མུག་པ་ དང་ །_ ཡིད་ ཀྱིས་ སྨོན་པ་ དང་ །_ སྨོན་ལམ་ འདེབས་པ་ དང་ །_ མངོན་པར་ འདུ་བྱེད་པ་ དེ་ ནི་ འདོད་པ འི་ ཁམས་ ཞེས་ བྱ འོ །_།
en: The desire realm comprises the beings in the hells, animals, anguished spirits, asuras, humans, |#| and the gods of the Heaven of the Four Great Kings, Heaven of the Thirty-Three, Heaven Free from Strife, Heaven of Joy, Heaven of Delighting in Emanations, and Heaven of Making Use of Others’ Emanations, |#| as well as anyone who yearns for, is attached to, is angry at, is ignorant of, wishes for, makes aspirations for, or conditions themselves to those types of beings.

source: གཟུགས་ ཀྱི་ ཁམས་ གང་ཞེ་ན །_
en: $86 “What is the form realm?

source: ཚངས་རིས་ ཀྱི་ ལྷ་ རྣམས་ དང་ །_ |#| ཚངས་པ་ མདུན་ན་འདོན་ རྣམས་ དང་ །_ |#| ཚངས་ཆེན་ དང་ །_ འོད་ཆུང་ དང་ །_ ཚད་ མེད་ འོད་ དང་ །_ འོད་གསལ་ དང་ །_ |#| དགེ་ཆུང་ དང་ །_ ཚད་ མེད་ དགེ་ དང་ །_ དགེ་རྒྱས་ དང་ །_ སྤྲིན་ མེད་ དང་ །_ བསོད་ནམས་ སྐྱེས་ དང་ །_ |#| འབྲས་བུ་ ཆེ་ དང་ །_ འདུ་ཤེས་ མེད་པ འི་ སེམས་ཅན་ དང་ །_ མི་ཆེ་བ་ དང་ །_ མི་གདུང་བ་ དང་ །_ གྱ་ནོམ་ སྣང་ དང་ །_ ཤིན་ཏུ་ མཐོང་ དང་ །_ འོག་མིན་ གྱི་ ལྷ་ རྣམས་ ཏེ །_ |#| གང་དེ་ དག་ ལ་ འདུན་པ་ དང་ །_ ཆགས་པ་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་མུག་ དང་ །_ ཡིད་ ཀྱིས་ སྨོན་པ་ དང་ །_ སྨོན་ལམ་ འདེབས་པ་ དང་ །_ མངོན་པར་ འདུ་བྱེད་པ་ དེ་ ནི་ གཟུགས་ ཀྱི་ ཁམས་ ཞེས་ བྱ འོ །_།
en: The form realm comprises the gods in the Brahmā Realm, |#| and the gods in the heavens of the High Priests of Brahmā, |#| Mahābrahmā, Limited Light, Limitless Light, Luminous, |#| Limited Virtue, Limitless Virtue, Perfected Virtue, Cloudless, Increased Merit, |#| Great Fruition, Concept-Free Beings, Unlofty, No Hardship, Sublime, Gorgeous, and Highest, |#| as well as anyone who yearns for, is attached to, is angry at, is ignorant of, wishes for, makes aspirations for, or conditions themselves to those types of beings.

source: གཟུགས་ མེད་པ འི་ ཁམས་ གང་ཞེ་ན །_
en: $87 “What is the formless realm?

source: ནམ་མཁའ་ མཐའ་ ཡ ས་ སྐྱེ་མཆེད་ དུ་ ཉེ་བ ར་ འགྲོ་བ འི་ ལྷ་ རྣམས་ དང་ །_ |#| རྣམ་ཤེས་ མཐའ་ ཡ ས་ སྐྱེ་མཆེད་ དུ་ ཉེ་བ ར་ འགྲོ་བ འི་ ལྷ་ རྣམས་ དང་ །_ |#| ཅི་ཡང་ མེད་པ འི་ སྐྱེ་མཆེད་ དུ་ ཉེ་བ ར་ འགྲོ་བ འི་ ལྷ་ རྣམས་ དང་ །_ |#| འདུ་ཤེས་ མེད་ འདུ་ཤེས་ མེད་ [172a] མིན་ སྐྱེ་མཆེད་ དུ་ ཉེ་བ ར་ འགྲོ་བ འི་ ལྷ་ རྣམས་ ཏེ །_ |#| གང་དེ་ དག་ ལ་ འདུན་པ་ དང་ །_ ཆགས་པ་ དང་ །_ ཞེ་སྡང་བ་ དང་ །_ གཏི་མུག་པ་ དང་ །_ ཡིད་ ཀྱིས་ སྨོན་པ་ དང་ །_ སྨོན་ལམ་ འདེབས་པ་ དང་ །_ མངོན་པར་ འདུ་བྱེད་པ་ གང་ཡིན་ པ་ དེ་ ནི་ གཟུགས་ མེད་པ འི་ ཁམས་ ཞེས་ བྱ་ སྟེ
en: The formless realm comprises the gods who move about in the Sphere of Infinite Space, |#| the gods who move about in the Sphere of Infinite Consciousness, |#| the gods who move about in the Sphere of Absolute Nothingness, |#| the gods who move about in the Sphere of Neither Perception nor Non-Perception, [172.a] |#| as well as anyone who yearns for, is attached to, is angry at, is ignorant of, wishes for, makes aspirations for, or conditions themselves to those types of beings.

source: དེ་ལྟ ར་ ཁམས་ གསུམ་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Thus do bodhisattvas know the three realms.

source: གཞན་ ཡང་ ཁམས་ བཞི་ རབ་ཏུ་ ཤེས་ ཏེ །_
en: $88 “Moreover, they know the four realms.

source: བཞི་ གང་ཞེ་ན །_
en: What are the four?

source: འདོད་པ འི་ ཁམས་ དང་ །_ གཟུགས་ ཀྱི་ ཁམས་ དང་ །_ གཟུགས་ མེད་པ འི་ ཁམས་ དང་ །_ འདུས་མ་བྱས་ ཀྱི་ ཁམས་ ཞེས་ བྱ་བ་ ཁམས་ བཞི་པོ་ དེ་དག་ སྟེ །_
en: The four are known as the desire realm, the form realm, the formless realm, and the unconditioned realm.

source: དེ་ལྟ ར་ ཁམས་ བཞི་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Thus do they know the four realms.

source: གཞན་ ཡང་ ཁམས་ དྲུག་ རབ་ཏུ་ ཤེས་ ཏེ །_
en: $89 “Moreover, they know the six realms.

source: འདོད་པ འི་ ཁམས་ དང་ །_ གནོད་སེམས་ ཀྱི་ ཁམས་ དང་ །_ རྣམ་པར་ འཚེ་བ འི་ ཁམས་ དང་ །_ མངོན་པར་ འབྱུང་བ འི་ ཁམས་ དང་ །_ གནོད་སེམས་ མེད་པ འི་ ཁམས་ དང་ །_ རྣམ་པར་ འཚེ་བ་ མེད་པ འི་ ཁམས་ ཏེ །_
en: They are the realms of desire, malice, harm, deliverance, freedom from malice, and freedom from harm.

source: ཁམས་ དྲུག་པོ་ དེ་དག་ རབ་ཏུ་ ཤེས་ སོ །_། གཞན་ ཡང་ ཁམས་ དྲུག་ རབ་ཏུ་ ཤེས་ ཏེ །_
en: Thus do they know the six realms. $90 “In addition to that, they know the six elements.

source: ས འི་ ཁམས་ དང་ །_ ཆུ འི་ ཁམས་ དང་ །_ མེ འི་ ཁམས་ དང་ །_ རླུང་ གི་ ཁམས་ དང་ །_ ནམ་མཁ འི་ ཁམས་ དང་ །_ རྣམ་པར་ ཤེས་པ འི་ ཁམས་ ཏེ །_ ཁམས་ དྲུག་པོ་ དེ་དག་ རབ་ཏུ་ ཤེས་ སོ །_།
en: They are the elements of earth, water, fire, wind, space, and consciousness. They know these six elements.

source: དེ་ ལ་ ས འི་ ཁམས་ ནི་ མི་རྟག་པ །_ མི་ བརྟན་པ །_ འགྱུར་བ འི་ ཆོས་ཅན་ ཏེ །_
en: Among them, the earth element bears the qualities of being impermanent, unstable, and subject to change—

source: མི་རྟག་པ་ གང་ཡིན་ པ་ དེ་ སྡུག་བསྔལ་བ འོ །_། སྡུག་བསྔལ་བ་ གང་ཡིན་ པ་ དེ་ བདག་མེད་པ འོ །_།
en: and that which is impermanent is suffering, and that which is suffering is selfless.

source: དེ་བཞིན་ དུ་ ཆུ འི་ ཁམས་ དང་ །_ མེ འི་ ཁམས་ དང་ །_ རླུང་ གི་ ཁམས་ དང་ །_ ནམ་མཁ འི་ ཁམས་ དང་ །_ རྣམ་པར་ ཤེས་པ འི་ ཁམས་ ཀྱང་ མི་རྟག་པ །_ མི་ བརྟན་པ །_ འགྱུར་བ འི་ ཆོས་ཅན་ ཏེ །_
en: In the same way, the elements of water, fire, wind, space, and consciousness also bear the qualities of being impermanent, unstable, and subject to change—and

source: མི་རྟག་པ་ གང་ཡིན་ པ་ དེ་ སྡུག་བསྔལ་བ འོ །_།
en: that which is impermanent is suffering, and

source: སྡུག་བསྔལ་བ་ གང་ཡིན་ པ་ དེ་ བདག་མེད་པ་ སྟེ །_
en: that which is suffering is selfless.

source: དེ་ལྟ ར་ ཁམས་ དྲུག་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Thus do they know the six elements accordingly.

source: དེ་ ཆོས་ དེ་དག་ ཉན་ ཅིང་ འཛིན་པ་ དང་ །_ མང་ དུ་ བྱེད་ ཅིང་ ཡོངས་སུ་ རྟོག་པ་ ན་ གཟུགས་ ཀྱི་ ཕུང་པོ་ དང་ །_ |#| ཚོར་བ འི་ ཕུང་པོ་ དང་ །_ འདུ་ཤེས་ ཀྱི་ ཕུང་པོ་ དང་ །_ འདུ་བྱེད་ ཀྱི་ ཕུང་པོ་ དང་ །_ རྣམ་པར་ ཤེས་པ འི་ ཕུང་པོ་ སྟེ །_ [172b] ཕུང་པོ་ ལྔ་ རབ་ཏུ་ ཤེས་ སོ །_།
en: $91 “When bodhisattvas hear those teachings and, retaining them, study and consider them, they come to understand the five aggregates. |#| These five are the aggregates of forms, sensations, perceptions, formations, and consciousness. [172.b]

source: གཟུགས་ ལ་ དབུ་བ་ རྡོ ས་པ་ ལྟ་བུ་ དང་ །_ ངན་པ་ དང་ །_ འཇིག་པ་ དང་ །_ རིང་ དུ་ མི་ གནས་པ་ དང་ །_
en: $92 “As for forms, they are like bubbles: worthless, fragile, and fleeting.

source: ཚོར་བ་ ལ་ ནི་ ཆུ འི་ ཆུ་བུར་ ལྟ་བུ་ དང་ །_ ངན་པ་ དང་ །_ འཇིག་པ་ དང་ །_ རིང་ དུ་ མི་ གནས་པ་ དང་ །_
en: Sensations are like foam on water: worthless, fragile, and fleeting.

source: འདུ་ཤེས་ ལ་ ནི་ སྨིག་རྒྱུ་ ལྟ་བུ་ དང་ །_ ངན་པ་ དང་ །_ འཇིག་པ་ དང་ །_ རིང་ དུ་ མི་ གནས་པ་ དང་ །_
en: Perceptions are like a mirage: worthless, fragile, and fleeting.

source: འདུ་བྱེད་ རྣམས་ ལ་ ནི་ ཆུ་ཤིང་ ལྟ་བུ་ དང་ །_ ངན་པ་ དང་ །_ འཇིག་པ་ དང་ །_ རིང་ དུ་ མི་ གནས་པ་ དང་ །_
en: Formations are like the plantain tree: worthless, fragile, and fleeting.

source: རྣམ་པར་ ཤེས་པ་ ལ་ ནི་ སྒྱུ་མ་ ལྟ་བུ་ དང་ །_ ངན་པ་ དང་ །_ འཇིག་པ་ དང་ །_ རིང་ དུ་ མི་ གནས་པ ར་ དེ་ལྟ ར་ ཕུང་པོ་ ལྔ་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Consciousness is like an illusion: worthless, fragile, and fleeting. Thus do bodhisattvas understand the five aggregates.

source: དེ་ ཆོས་ དེ་དག་ ཉན་ ཅིང་ འཛིན་པ་ དང་ །_ མང་ དུ་ བྱེད་ ཅིང་ ཡོངས་སུ་ རྟོག་པ་ ན་ ནང་ གི་ སྐྱེ་མཆེད་ དྲུག་ རབ་ཏུ་ ཤེས་ ཏེ །_
en: $93 “When bodhisattva hear those teachings and, retaining them, study and consider them, they come to understand the six inner sense spheres.

source: མིག་ ནང་ གི་ སྐྱེ་མཆེད་ དང་ །_ རྣ་བ་ དང་ །_ སྣ་ དང་ །_ ལྕེ་ དང་ །_ ལུས་ དང་ །_ ཡིད་ ནང་ གི་ སྐྱེ་མཆེད་ ཅེས་བྱ་བ་ ནང་ གི་ སྐྱེ་མཆེད་ དྲུག་པོ་ དེ་དག་ གོ _།
en: The six inner sense spheres are known as the inner sense spheres of the eyes, ears, nose, tongue, body, and mind.

source: དེ་ ལ་ མིག་ ནང་ གི་ སྐྱེ་མཆེད་ ནི་ ན་བ འི་ ཆོས་ཅན་ དང་ །_ རྒ་བ འི་ ཆོས་ཅན་ དང་ །_ འཆི་བ འི་ ཆོས་ཅན་ དང་ །_
en: $94 “Among them, bodhisattvas understand that the inner sense sphere of the eyes is subject to sickness, aging, and death;

source: བདག་ དང་ བདག་ གིས་ སྟོང་པ་ དང་ །_
en: is empty of both ‘me’ and ‘mine’;

source: འདོད་ཆགས་ ཀྱི་ མེ་ དང་ །_ ཞེ་སྡང་ གི་ མེ་ དང་ །_ གཏི་མུག་ གི་ མེ་ ཀུན་ ཏུ་ འབར་བ་ དང་ །_
en: is ablaze with the fires of desire, aversion, and ignorance;

source: སྐྱེ་བ་ དང་ །_ རྒ་བ་ དང་ །_ ན་བ་ དང་ འཆི་བ་ དང་ །_ མྱ་ངན་ དང་ །_ སྨྲེ་སྔགས་ འདོན་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ ཡིད་ མི་ བདེ་བ་ དང་ །_ འཁྲུག་པ་ རྣམས་ ཀྱིས་ ཀུན་ ཏུ་ འབར་བ་ དང་ །_ སྡུག་བསྔལ་ གྱིས་ ཀུན་ ཏུ་ འབར་བ ར་ རབ་ཏུ་ ཤེས་ སོ །_།
en: is ablaze with birth, aging, sickness, death, sorrow, lamentation, suffering, unhappiness, and despair; and is ablaze with suffering.

source: དེ་བཞིན་ དུ་ རྣ་བ་ དང་ །_ སྣ་ དང་ །_ ལྕེ་ དང་ །_ ལུས་ དང་ །_ ཡིད་ ནང་ གི་ སྐྱེ་མཆེད་ ལ་ ཡང་ན་བ འི་ ཆོས་ཅན་ དང་ །_ རྒ་བ འི་ ཆོས་ཅན་ དང་ །_ འཆི་བ འི་ ཆོས་ཅན་ དང་ །_ བདག་ དང་ བདག་ གིས་ སྟོང་པ་ དང་ །_
en: $95 “Likewise, bodhisattvas know that the inner sense spheres of the ears, nose, tongue, body, and mind are also subject to sickness, aging, and death; are empty of both ‘me’ and ‘mine’;

source: སྐྱེ་བ་ དང་ །_ རྒ་བ་ དང་ །_ ན་བ་ དང་ །_ འཆི་བ་ དང་ །_ མྱ་ངན་ དང་ །_ སྨྲེ་སྔགས་ འདོན་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ ཡིད་ མི་ བདེ་བ་ དང་ །_ འཁྲུགས་པ་ རྣམས་ ཀྱིས་ ཀུན་ ཏུ་ འབར་བ་ དང་ །_
en: are ablaze with birth, aging, sickness, death, sorrow, lamentation, suffering, unhappiness, and despair;

source: སྡུག་བསྔལ་ གྱིས་ ཀུན་ ཏུ་ འབར་བ ར་ རབ་ཏུ་ ཤེས་ ཏེ དེ་ལྟ ར་ ནང་ གི་ སྐྱེ་མཆེད་ དྲུག་པོ་ དག་ རབ་ཏུ་ ཤེས་ སོ །_།
en: and ablaze with suffering. Thus do they understand the six inner sense spheres.

source: གཞན་ ཡང་ཕྱི འི་ སྐྱེ་མཆེད་ དྲུག་ རབ་ཏུ་ ཤེས་ [173a] ཏེ །_ མིག་ གིས་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ གཟུགས་ རྣམས་ ཕྱི འི་ སྐྱེ་མཆེད་ དང་ །_
en: $96 “Furthermore, bodhisattvas understand the six outer sense spheres [173.a] as the forms cognized through the eyes,

source: རྣ་བ ས་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ སྒྲ་ རྣམས་ དང་ །_
en: the sounds cognized through the ears,

source: སྣ ས་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ དྲི་ རྣམས་ དང་ །_
en: the smells cognized through the nose,

source: ལྕེ ས་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ རོ་ རྣམས་ དང་ །_
en: the tastes cognized through the tongue,

source: ལུས་ ཀྱིས་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ རེག་བྱ་ རྣམས་ དང་ །_
en: the tangibles cognized through the body, and

source: ཡིད་ ཀྱིས་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ ཆོས་ ཕྱི འི་ སྐྱེ་མཆེད་ རྣམས་ ཤེས་བྱ་བ་ སྟེ །_ སྐྱེ་མཆེད་ དྲུག་པོ་ དེ་དག་ གོ _།
en: the phenomena cognized by the mind. These six are known as the outer sense spheres.

source: དེ་ ལ་ མིག་ གི་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ གཟུགས་ ཕྱི འི་ སྐྱེ་མཆེད་ ལ་ སྐྱབས་ མེད་པ་ དང་ །_ མགོན་མེད་པ་ དང་ །_ སྟོབས་མེད་པ་ དང་ །_ ཉམ་ཆུང་བ་ སྟེ །_
en: $97 “Among them, the outer sense sphere of forms cognized through#35 the eyes is unreliable, undependable, powerless, and fragile,

source: དེ་ ལ་ རྟག་པ འམ །_ བརྟན་པ་ འམ །_ ཐེར་ཟུག་ གམ །_ དེ་བཞིན་ཉིད་ དམ །_ མ་ ནོར་བ་ དེ་བཞིན་ཉིད་ དམ །_ གཞན་མ་ ཡིན་པ་ དེ་བཞིན་ཉིད་ ནི་ གང་ཡང་ མེད་ ཀྱི །_
en: for it utterly lacks permanence, solidity, endurance, reality, unmistaken reality, or incontrovertible reality.

source: སྒྱུ་མ་ དེ་ ནི་ ཡོད །_ |#| སྒྱུ་མ ར་ བྱས་པ་ དེ་ ནི་ ཡོད །_ |#| སེམས་ རྨོངས་པ ར་ བྱེད་པ་ དེ་ ནི་ ཡོད་ དེ །_ གང་ཅི་ ཡང་ ཡོད་པ་ དང་ །_
en: All that it has is illusion, the creation of illusion, |#| and the capacity to delude the mind.

source: དེ་བཞིན་ དུ་ རྣ་བ ས་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ སྒྲ་ རྣམས་ དང་ །_
en: Likewise, the outer sense spheres of the sounds cognized through the ears,

source: ཡིད་ ཀྱིས་ རྣམ་པར་ ཤེས་པ ར་ བྱ་བ་ ཆོས་ ཕྱི འི་ སྐྱེ་མཆེད་ ལ་ ཡང་ སྐྱབས་ མེད་པ་ དང་ །_ མགོན་མེད་པ་ དང་ །_ སྟོབས་མེད་པ་ དང་ །_
en: and the phenomena cognized by the mind are unreliable, undependable, powerless, |#| and

source: ཉམ་ཆུང་བ་ སྟེ །_ |#| དེ་ ལ་ རྟག་པ་ འམ །_ བརྟན་པ་ འམ །_ ཐེར་ཟུག་པ་ འམ །_ དེ་བཞིན་ཉིད་ དམ །_ མ་ ནོར་བ་ དེ་བཞིན་ཉིད་ དམ །_ གཞན་མ་ ཡིན་པ་ དེ་བཞིན་ཉིད་ ནི་ གང་ཡང་ མེད་ ཀྱི །_ སྒྱུ་མ་ དེ་ ནི་ ཡོད །_
en: fragile, for they utterly lack permanence, solidity, endurance, reality, unmistaken reality, or incontrovertible reality.

source: སྒྱུ་མ ར་ བྱས་པ་ དེ་ ནི་ ཡོད །_ སེམས་ རྨོངས་པ ར་ བྱེད་པ་ དེ་ ནི་ ཡོད་ དེ །_
en: All that they have is illusion, the creation of illusion, and the capacity to delude the mind.

source: གང་ཅི་ ཡང་ ཡོད་པར་ ཕྱི འི་ སྐྱེ་མཆེད་ དྲུག་པོ་ དེ་ལྟ ར་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Thus do bodhisattvas understand the six outer sense spheres.

source: དེ་ ཆོས་ དེ་དག་ ཉན་ ཅིང་ འཛིན་པ་ དང་ །_ མང་ དུ་ བྱེད་ ཅིང་ ཡོངས་སུ་ རྟོག་པ་ ན་ འཕགས་པ འི་ བདེན་པ་ བཞི་ རབ་ཏུ་ ཤེས་ སོ །_།
en: $98 “So, when bodhisattvas hear those teachings and, retaining them, study and consider them, they come to understand the four truths of noble beings.

source: སྡུག་བསྔལ་ འཕགས་པ འི་ བདེན་པ་ དང་ །_ |#| སྡུག་བསྔལ་ ཀུན་འབྱུང་བ་ དང་ །_ |#| སྡུག་བསྔལ་ འགོག་པ་ དང་ །_ |#| སྡུག་བསྔལ་ འགོག་པར་ འགྲོ་བ འི་ ལམ་ འཕགས་པ འི་ བདེན་པ་ ཞེས་ བྱ་བ་ འཕགས་པ འི་ བདེན་པ་ བཞི་པོ་ དེ་དག་ གོ _།
en: They are the truths, according to noble beings, |#| of suffering, the source of suffering, |#| the cessation of suffering, |#| and the path to the cessation of suffering. Those are known as the truths of noble beings.

source: ཕུང་པོ་ ལྔ་ རྣམས་ དང་ །_ ཁམས་ དྲུག་པོ་ དང་ །_ ནང་ གི་ སྐྱེ་མཆེད་ དྲུག་པོ་ དག་ དང་ །_ [173b] ཕྱི འི་ སྐྱེ་མཆེད་ དྲུག་པོ་ དག་ གང་ཡིན་པ་ དེ་ ནི་ སྡུག་བསྔལ་ ཞེས་ བྱ་ སྟེ །_
en: $99 “The five aggregates, six sensory elements, six inner sense spheres, [173.b] and six outer sense spheres are known as suffering.

source: སྡུག་བསྔལ་ དེ་ ནི་ མི་རྟག་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ ནད་ དང་ །_ འབྲས་ དང་ །_ ཟུག་རྔུ་ དང་ །_ སྡིག་པ་ དང་ །_ བདག་མེད་པ་ དང་ །_ རབ་ཏུ་ འཇིག་པ འི་ ཆོས་ཉིད་ དུ་ བལྟ འོ །_།
en: Bodhisattvas regard suffering as impermanent, intolerable, sickly, tumorous, painful, sinful, selfless, and perishable by nature.
